IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP9_CONTROLSS_ECAP9.xml
	<register id="CONTROLSS_ECAP9_ECEINT" acronym="CONTROLSS_ECAP9_ECEINT" offset="0x2C" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Monitoring unit 2 error event 2 interrupt enable 0 : Disable Monitoring unit 2 error event 2 interrupt 1 : Enable Monitoring unit 2 error event 2 interrupt" range="12" rwaccess="RW"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Monitoring unit 2 error event 2 interrupt enable 0 : Disable Monitoring unit 2 error event 1 interrupt 1 : Enable Monitoring unit 2 error event 1 interrupt" range="11" rwaccess="RW"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Monitoring unit 1 error event 1 interrupt enable 0 : Disable Monitoring unit 1 error event 2 interrupt 1 : Enable Monitoring unit 1 error event 2 interrupt" range="10" rwaccess="RW"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Monitoring unit 1 error event 1 interrupt enable 0 : Disable Monitoring unit 1 error event 1 interrupt 1 : Enable Monitoring unit 1 error event 1 interrupt" range="9" rwaccess="RW"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error interrupt enable    0   |   ECAP_DISAB_HRERROR_INTERRUPTDisable High Resolution Error as an Interrupt source      1   |   ECAP_ENAB_HRERROR_INTERRUPTEnable High Resolution Error as an Interrupt source  " range="8" rwaccess="RW"/> 
		<bitfield id="CTR_EQ_CMP" width="1" begin="7" end="7" resetval="0x0" description="Counter Equal Compare Interrupt Enable    0   |   ECAP_DISAB_CE_INTERRUPTDisable Compare Equal as an Interrupt source      1   |   ECAP_ENAB_CE_INTERRUPTEnable Compare Equal as an Interrupt source  " range="7" rwaccess="RW"/> 
		<bitfield id="CTR_EQ_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Interrupt Enable    0   |   ECAP_DISAB_PE_INTERRUPTDisable Period Equal as an Interrupt source      1   |   ECAP_ENAB_PE_INTERRUPTEnable Period Equal as an Interrupt source  " range="6" rwaccess="RW"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Interrupt Enable    0   |   ECAP_DISAB_CO_INTERRUPTDisabled counter Overflow as an Interrupt source      1   |   ECAP_ENAB_CO_INTERRUPTEnable counter Overflow as an Interrupt source  " range="5" rwaccess="RW"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Interrupt Enable    0   |   ECAP_DISAB_CAP4_INTERRUPTDisable Capture Event 4 as an Interrupt source      1   |   ECAP_ENAB_CAP4_INTERRUPTCapture Event 4 Interrupt Enable  " range="4" rwaccess="RW"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Interrupt Enable    0   |   ECAP_DISAB_CAP3_INTERRUPTDisable Capture Event 3 as an Interrupt source      1   |   ECAP_ENAB_CAP3_INTERRUPTEnable Capture Event 3 as an Interrupt source  " range="3" rwaccess="RW"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Interrupt Enable    0   |   ECAP_DISAB_CAP2_INTERRUPTDisable Capture Event 2 as an Interrupt source      1   |   ECAP_ENAB_CAP2_INTERRUPTEnable Capture Event 2 as an Interrupt source  " range="2" rwaccess="RW"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Interrupt Enable    0   |   ECAP_DISAB_CAP1_INTERRUPTDisable Capture Event 1 as an Interrupt source      1   |   ECAP_ENAB_CAP1_INTERRUPTEnable Capture Event 1 as an Interrupt source  " range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_ECFLG" acronym="CONTROLSS_ECAP9_ECFLG" offset="0x2E" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="12" rwaccess="RO"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="11" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="10" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="9" rwaccess="RO"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_HIGH_RESOLUTION_ERRORIndicates the High resolution Error occurred  " range="8" rwaccess="RO"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Compare Equal Compare Status Flag. This flag is active only in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_COMPARE_REGIndicates the counter (TSCTR) reached the compare register value (ACMP)  " range="7" rwaccess="RO"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Flag. This flag is only active in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_PERIOD_VALUE_RESETIndicates the counter (TSCTR) reached the period register value (APRD) and was reset.  " range="6" rwaccess="RO"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Flag. This flag is active in CAP and APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_TRANSIndicates the counter (TSCTR) has made the transition from FFFFFFFF to 00000000  " range="5" rwaccess="RO"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Flag This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_4TH_EVENT_ECAPXIndicates the fourth event occurred at ECAPx pin  " range="4" rwaccess="RO"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Flag. This flag is active only in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_3RD_EVENT_ECAPXIndicates the third event occurred at ECAPx pin.  " range="3" rwaccess="RO"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_2ND_EVENT_ECAPXIndicates the second event occurred at ECAPx pin.  " range="2" rwaccess="RO"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_1ST_EVENT_ECAPXIndicates the first event occurred at ECAPx pin.  " range="1" rwaccess="RO"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Status Flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_INTERRUPTIndicates that an interrupt was generated.  " range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP9_ECCLR" acronym="CONTROLSS_ECAP9_ECCLR" offset="0x30" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT2 interrupt flag" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT1 interrupt flag" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT2 interrupt flag" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT1 interrupt flag" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_HRERRORWriting a 1 clears the HRERROR flag.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Counter Equal Compare Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_CMPWriting a 1 clears the CTR=CMP flag.  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_PRDWriting a 1 clears the CTR=PRD flag.  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTROVFWriting a 1 clears the CTROVF flag.  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT4Writing a 1 clears the CEVT4 flag.  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT3Writing a 1 clears the CEVT3 flag.  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT2Writing a 1 clears the CEVT2 flag.  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT1Writing a 1 clears the CEVT1 flag.  " range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ECAP Global Interrupt Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_INTWriting a 1 clears the INT flag and enable further interrupts to be generated if any of the event flags are set to 1  " range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
