IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP9_CONTROLSS_ECAP9.xml
	<register id="CONTROLSS_ECAP9_HRDEBUGOBSERVE1" acronym="CONTROLSS_ECAP9_HRDEBUGOBSERVE1" offset="0x78" width="32" description="">
		<bitfield id="HROUTH" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 1" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP9_HRDEBUGOBSERVE2" acronym="CONTROLSS_ECAP9_HRDEBUGOBSERVE2" offset="0x7C" width="32" description="">
		<bitfield id="HROUTL" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 2" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_COMMON_CTL" acronym="CONTROLSS_ECAP9_MUNIT_COMMON_CTL" offset="0x80" width="32" description="">
		<bitfield id="GLDSTRBSEL" width="7" begin="14" end="8" resetval="0x0" description="Global load strobe select to enable shadow to active loading 0x0 : Disabled with SOC level tieoff. 0x1 to 0x7F : Global load strobe from SOC level including ETPWM global load strobes." range="14 - 8" rwaccess="RW"/> 
		<bitfield id="TRIPSEL" width="7" begin="6" end="0" resetval="0x0" description="Trip signal select to disable and enable signal monitoring automatically  0x0 : Disabled, Trip signals does not affect signal monitoring, achieved with SOC level tieoff. 0x1 to 0x7F : Signal monioring is disabled when selected signal is high and enabled when it is low" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_CTL" acronym="CONTROLSS_ECAP9_MUNIT_1_CTL" offset="0xC0" width="32" description="">
		<bitfield id="MON_SEL" width="4" begin="11" end="8" resetval="0x0" description="Type of monitoring  0 : High Pulse width  1 : Low Pulse width  2 : Period width from Rise to Rise  3 : Period width from fall to fall  4 : Monitor rise edge  5 : Monitor fall edge  6-15 : Reserved (High Pulse width)" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="DEBUG_RANGE_EN" width="1" begin="1" end="1" resetval="0x0" description="Debug mode enable. 0 : Debug mode is disabled. 1 : Debug mode of monitoring unit 1 is enabled to obtain the variation seen in the system for debug purpose. Range is captured in MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers  Toggle DEBUG_RANGE_EN to restart this process, this will initialize MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers." range="1" rwaccess="RW"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="0 : Monitoring unit 1 is disabled 1 : Monitoring unit 1 is enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_SHADOW_CTL" acronym="CONTROLSS_ECAP9_MUNIT_1_SHADOW_CTL" offset="0xC4" width="32" description="">
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="Load mode 0 : Active registers are loaded with shadow on next sync event  1 : Active registers are loaded with shadow on EPWMx.GLDLCSTRB event" range="2" rwaccess="RW"/> 
		<bitfield id="SWSYNC" width="1" begin="1" end="1" resetval="0x0" description="Copies Min and Max values from shadow to active registers immediately if MUNIT_1_SHADOW_CTL.SYNCI_EN is set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SYNCI_EN" width="1" begin="0" end="0" resetval="0x0" description="Shadow Enable 0 : Disabled 1 : Enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_MIN" acronym="CONTROLSS_ECAP9_MUNIT_1_MIN" offset="0xD0" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Minimum value for monitoring" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_MAX" acronym="CONTROLSS_ECAP9_MUNIT_1_MAX" offset="0xD4" width="32" description="">
		<bitfield id="MAX_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Maximum value for monitoring" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_MIN_SHADOW" acronym="CONTROLSS_ECAP9_MUNIT_1_MIN_SHADOW" offset="0xD8" width="32" description="">
		<bitfield id="MIN_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow minimum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_MAX_SHADOW" acronym="CONTROLSS_ECAP9_MUNIT_1_MAX_SHADOW" offset="0xDC" width="32" description="">
		<bitfield id="MAX_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow maximum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_DEBUG_RANGE_MIN" acronym="CONTROLSS_ECAP9_MUNIT_1_DEBUG_RANGE_MIN" offset="0xE0" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x4294967295" description="Observed Min value of check being enabled on minotoring unit 1. Is updated when MUNIT_1_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_1_DEBUG_RANGE_MAX" acronym="CONTROLSS_ECAP9_MUNIT_1_DEBUG_RANGE_MAX" offset="0xE4" width="32" description="">
		<bitfield id="MAX_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Observed Min value of check being enabled on minotoring unit 1. Is updated when MUNIT_1_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_2_CTL" acronym="CONTROLSS_ECAP9_MUNIT_2_CTL" offset="0x100" width="32" description="">
		<bitfield id="MON_SEL" width="4" begin="11" end="8" resetval="0x0" description="Type of monitoring  0 : High Pulse width  1 : Low Pulse width  2 : Period width from Rise to Rise  3 : Period width from fall to fall  4 : Monitor rise edge  5 : Monitor fall edge  6-15 : Reserved (High Pulse width)" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="DEBUG_RANGE_EN" width="1" begin="1" end="1" resetval="0x0" description="Debug mode enable. 0 : Debug mode is disabled. 1 : Debug mode of monitoring unit 2 is enabled to obtain the variation seen in the system for debug purpose. Range is captured in MUNIT_2_DEBUG_RANGE_MIN and MUNIT_2_DEBUG_RANGE_MAX registers  Toggle DEBUG_RANGE_EN to restart this process, this will initialize MUNIT_2_DEBUG_RANGE_MIN and MUNIT_2_DEBUG_RANGE_MAX registers." range="1" rwaccess="RW"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="0 : Monitoring unit 2 is disabled 1 : Monitoring unit 2 is enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP9_MUNIT_2_SHADOW_CTL" acronym="CONTROLSS_ECAP9_MUNIT_2_SHADOW_CTL" offset="0x104" width="32" description="">
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="Load mode 0 : Active registers are loaded with shadow on next sync event  1 : Active registers are loaded with shadow on EPWMx.GLDLCSTRB event" range="2" rwaccess="RW"/> 
		<bitfield id="SWSYNC" width="1" begin="1" end="1" resetval="0x0" description="Copies Min and Max values from shadow to active registers immediately if MUNIT_2_SHADOW_CTL.SYNCI_EN is set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SYNCI_EN" width="1" begin="0" end="0" resetval="0x0" description="Shadow Enable 0 : Disabled 1 : Enabled" range="0" rwaccess="RW"/>
	</register>
